/* 
  Localizable.strings
  Tyme3

  Created by Lars Gerckens on 03.11.21.
  Copyright © 2021 Lars Gerckens. All rights reserved.
*/

/*
 Changelog:

 5.4
 - Camera & Headphones observer bugfix

*/

/*

Screenshot Size:
-----------------------------------------------------------------
1280x800 1440x900 2560x1600 2880x1800

Subtitle:
Automation for Shortcuts
 
Shortery Keywords:
-----------------------------------------------------------------
shortcuts, automate, automation, hotkeys, trigger, launch, run

Shortery App Store Description:
-----------------------------------------------------------------
Run your Shortcuts automatically with Shortery.

Tired of manually executing a Shortcut every morning when starting to work?
Just add the Shortcut to Shortery and let it run automatically.

Shortery offers several different triggers to run a Shortcut:

* Appearance
Run a Shortcut when your Mac changes from dark to light mode or light to dark mode.

* Applications
Run a shortcut when you start or quit an app or when the app becomes active / inactive.

* Audio
Run a Shortcut when you start, stop or record audio.

* Calendar Events
Run a Shortcut when a meeting starts or ends.

* Camera
Run shortcuts when your webcam is switched on or off.

* Devices
Run a shortcut when you connect or disconnect any USB, Bluetooth device, your headphones, network volumes or any external disk or SD card.

* Focus Mode
Trigger a shortcut when a focus mode on your Mac changes.

* Folders
Observe any folder on your Mac and run a shortcut, when the contents change.

* Keyboard
Need direct access to a Shortcut? Define a global hotkey and trigger it from any app.

* Login & Logout
How about your Mac greeting you in the morning and telling you about your current day? Use the Login-Trigger to get your day started.

* Monitors
Trigger a shortcut, when you connect or disconnect a monitor.

* Power
Run a Shortcut when you plug in a power adapter or your battery capacity runs low.

* Screen
Triggers a Shortcut, when you lock or unlock your screen.

* Sunrise & Sunset
Run Shortcuts when the sun sets or rises based on your current location.

* Time
Set a time when the Shortcut should run and define how often it should be repeated.

* Wake Up & Sleep
Run Shortcuts before your Mac goes to sleep or after it wakes up.

* WiFi
Run a shortcut when your WiFi connection changes.

 */

/*

 Run any Shortcut from the Shortcuts app automatically.
 When you start an application, connect USB, Bluetooth devices or a monitor, when your WiFi connection changes, you log in or log out, your Mac looses power and many more…

 */

"AppTitle" = "Shortery";
"AppSubTitle" = "快捷指令自动化";
"AppSearchFieldSearch" = "搜索…";

"AppVersionInformation" = "Mac平台缺失的自动化效率工具 - 快捷指令管理专家。版本 %@";

"MenuBarTitle" = "Shortery";
"MenuBarShow" = "显示 Shortery";
"MenuBarTriggers" = "%@ 个活动触发器";
"MenuBarLastRun" = "%@, %@";
"MenuBarQuit" = "退出 Shortery";

"ToolbarItemTrigger" = "触发器";
"ToolbarItemPreferences" = "设置";
"ToolbarItemAbout" = "关于";

"IntroText" = "充分利用你的快捷指令，通过自动运行它们。只需添加一个新的触发器，选择你的快捷指令并设置运行方式。请注意，Shortery 和你的 Mac 必须处于运行和唤醒状态，才能替你执行快捷指令。";

"NoShortcutsFound" = "未找到快捷指令。你可能在 **快捷指令应用** 中没有快捷指令，或拒绝 Shortery 访问快捷指令。请在 **设置 > 安全性与隐私 > 自动化 > Shortery > 快捷指令及快捷指令事件** 中检查状态。";

"ShortcutsFolderBug" = "如果此列表中缺少整个快捷指令文件夹：**请重启你的 Mac**。这仍然是快捷指令应用和最新 macOS 的问题。";

"NoTriggersHint" = "未配置任何快捷指令触发器。要添加第一个触发器，请点击 **⊕ 添加快捷指令触发器** 按钮。";

"ButtonAddShortcut" = "添加快捷指令触发器";

"LastRunNever" = "上次运行：从未";
"LastRunDate" = "上次运行：%@";

"PreferencesContactInfo" = "感谢您使用 Shortery。如果您有任何问题或希望添加功能，请 [告知我们](mailto:shortery@numberfive.co?subject=Shortery)。若在设置触发器时遇到问题，也请查看 [常见问题](https://www.numberfive.co/faq_shortery.html)。\n\n对其他提升生产力的应用感兴趣？请查看 [Tyme](https://www.tyme-app.com?ref=Shortery) —— 一款简单而高效的时间追踪应用。\n\n© 2021 – 2025 Unit Numberfive oHG - 版权所有 汉化by - mengnimen";

"PreferencesStartAtLogin" = "登录时启动";
"PreferencesStartAtLoginHint" = "若要使用登录触发器，需要启用此选项。";

"PreferencesShowMenuBar" = "显示菜单栏图标";
"PreferencesShowMenuBarHint" = "禁用菜单栏图标后，只能通过 Finder > 应用程序 > Shortery 打开 Shortery。";

"PreferencesPreventSleep" = "防止休眠";
"PreferencesPreventSleepHint" = "当 Mac 处于睡眠状态时，Shortery 无法运行快捷指令。启用此选项后，Shortery 将防止你的 Mac 进入睡眠状态，以确保所有快捷指令能在适当时刻执行。请注意，macOS 仍可能因关闭屏幕、点击 Apple 菜单、电量不足或其他原因进入睡眠状态。";

"PreferencesCheckUpdates" = "检查更新";

"PreferencesEnableLogging" = "启用调试日志";
"PreferencesOpenLogFolder" = "打开日志文件夹";

"PreferencesOpenDatabase" = "打开数据库及日志文件夹";

"cancelButtonTitle" = "取消";
"okButtonTitle" = "保存";

"NewShortcutTitle" = "配置快捷指令触发器";

"TypeTimeHint" = "此触发器基于时间运行快捷指令。请选择定时器的重复方式。";
"TypeLoginHint" = "此触发器在你登录、注销或关闭 Mac 时运行快捷指令。";
"TypeHotkeyHint" = "此触发器通过全局键盘快捷键运行快捷指令，可在任意应用中激活。";
"TypeAppHint" = "此触发器在应用启动或退出时运行快捷指令。";
"TypeWorkspaceHint" = "此触发器在 Mac 进入睡眠或唤醒时运行快捷指令。";
"TypeAppearanceHint" = "此触发器在外观由深色切换为浅色或由浅色切换为深色时运行快捷指令。";
"TypePowerStatusHint" = "此触发器在你插入电源适配器或电池电量变化时运行快捷指令。Shortery 每分钟检查一次电池状态。";
"TypeFocusModeHint" = "此触发器在 Mac 的焦点模式变化时运行快捷指令。请确保在 **系统设置 > 焦点 > 焦点状态 > 开** 中共享焦点状态。使用焦点模式触发器需要至少安装 **macOS 14.0**。";
"TypeScreenLockHint" = "此触发器在你锁定或解锁屏幕时运行快捷指令。";
"TypeDeviceConnectionHint" = "此触发器在你连接或断开蓝牙、USB 设备、耳机、网络卷或任何外接磁盘及 SD 卡时运行快捷指令。";
"TypeMonitorHint" = "此触发器在你连接或断开显示器时运行快捷指令。";
"TypeWiFiHint" = "此触发器在你连接或断开特定 WiFi 时运行快捷指令。";
"TypeSunHint" = "此触发器根据你当前位置在日出或日落时运行快捷指令。";
"TypeFolderHint" = "此触发器在文件夹内容发生变化（文件新增、重命名或删除）时运行快捷指令。";
"TypeCalendarHint" = "此触发器可针对日历事件运行快捷指令。它将在事件开始和结束时触发，并将字符串 **started** 或 **ended** 传递给快捷指令。";
"TypeCameraHint" = "当你的摄像头开启或关闭时运行快捷指令。";
"TypeAudioHint" = "当你开始或停止播放或录制音频时运行快捷指令。";
"TypeLanHint" = "当你通过有线连接或断开局域网时运行快捷指令。";

"ShortcutEnabled" = "启用触发器";
"ShortcutRunLocked" = "在 Mac 锁定时运行";
"ShortcutRunLockedHint" = "如果触发器不应在您的 Mac 锁定时运行，Shortery 将延迟触发器，直到您的 Mac 解锁。";

"ShortcutType" = "触发器类型";
"ShortcutTypeApp" = "应用程序";
"ShortcutTypeTime" = "时间";
"ShortcutTypeWorkspace" = "唤醒和睡眠";
"ShortcutTypeLogin" = "登录和注销";
"ShortcutTypeHotkey" = "键盘";
"ShortcutTypeAppearance" = "外观";
"ShortcutTypePower" = "电源状态";
"ShortcutTypeFocus" = "焦点模式";
"ShortcutTypeScreenLock" = "屏幕锁定和解锁";
"ShortcutTypeDeviceConnection" = "设备";
"ShortcutTypeMonitor" = "显示器";
"ShortcutTypeWiFi" = "WiFi";
"ShortcutTypeSun" = "日出和日落";
"ShortcutTypeFolder" = "文件夹内容";
"ShortcutTypeCalendar" = "日历事件";
"ShortcutTypeCamera" = "摄像头";
"ShortcutTypeAudio" = "音频";
"ShortcutTypeLan" = "局域网";

"ShortcutSelect" = "选择捷径";
"ShortcutLoading" = "加载中…";
"ShortcutSelectPlease" = "请选择…";
"ShortcutName" = "名称";
"ShortcutNamePlaceholder" = "名称";

"ShortcutReloadList" = "重新加载捷径列表";

"ShortcutInputHintLabel" = "输入字符串";
"ShortcutInputHintText" = "%@ 在触发时发送给捷径。";

"ShortcutTime" = "在";
"ShortcutTimeRepeat" = "重复";
"ShortcutTimeRepeatMinute" = "每 %i 分钟";
"ShortcutTimeRepeatHour" = "每 %i 小时";
"ShortcutTimeRepeatDay" = "每天";
"ShortcutTimeRepeatWeek" = "每周";
"ShortcutTimeRepeatMultiplier" = "倍数";
"ShortcutTimeWeekdays" = "工作日";
"ShortcutTimeFireIfMissed" = "不跳过";
"ShortcutTimeFireIfMissedHint" = "当 Shortery 因 Mac 睡眠等原因未能准时触发时，计时器将在稍后（如 Mac 醒来后）触发。";
"ShortcutTimeNextTimers" = "预定触发器";
"ShortcutTimeFromDate" = "介于";
"ShortcutTimeToDate" = "至";

"ShortcutAppUseBundleID" = "将应用程序的 Bundle ID 与事件名称一起作为快捷指令的输入，以换行符分隔。";
"ShortcutAppSelect" = "应用程序";
"ShortcutAppSelectHint" = "必须在运行状态下才能选择该应用。";
"ShortcutAppEvent" = "应用状态";
"ShortcutAppEventStarted" = "启动";
"ShortcutAppEventQuit" = "退出";
"ShortcutAppEventActive" = "激活";
"ShortcutAppEventInactive" = "未激活";
"ShortcutAppEventDelay" = "延迟（秒）";
"ShortcutAppEventDelayHint" = "为应用触发器添加延迟。此延迟为全局延迟，即在应用程序激活、未激活、启动或退出后，Shortery 将等待指定秒数后再触发。可用于避免在快速切换应用时重复触发。";

"ShortcutEventLoginLabel" = "触发于";
"ShortcutEventLogin" = "登录";
"ShortcutEventLogout" = "注销";
"ShortcutEventLogoutHint" = "请注意，注销期间可能无法启动其他应用或进程。较小且快速的任务应可正常运行。macOS 会尝试在注销时终止所有进程。";

"ShortcutWorkspaceEvent" = "Mac";
"ShortcutWorkspaceEventWake" = "唤醒";
"ShortcutWorkspaceEventSleep" = "睡眠";

"ShortcutHotkey" = "键盘快捷键";
"ShortcutHotkeyPlaceholder" = "点击以录制…";

"ShortcutAppearanceEvent" = "当设置为";
"ShortcutAppearanceEventLightMode" = "浅色模式";
"ShortcutAppearanceEventDarkMode" = "深色模式";

"ShortcutPowerStatusEvent" = "事件";
"ShortcutPowerStatusEventACConnected" = "交流电连接";
"ShortcutPowerStatusEventACDisconnected" = "交流电断开";
"ShortcutPowerStatusEventBatteryAbove" = "电池高于";
"ShortcutPowerStatusEventBatteryBelow" = "电池低于";

"ShortcutPowerStatusBatteryPercentage" = "电池百分比";

"ShortcutFocusChangeType" = "模式";
"ShortcutFocusChangeTypeAny" = "任意焦点";
"ShortcutFocusChangeTypeSpecific" = "特定焦点激活时";
"ShortcutFocusModeSelection" = "为";
"ShortcutFocusModeEnabled" = "激活";
"ShortcutFocusModeDisabled" = "未激活";
"ShortcutFocusModeSpecificHint" = "当你的 Mac 切换 **任意焦点** 为开/关状态，或 **特定焦点** 激活时，即可触发快捷指令。\n\n请确保 **系统设置 > 焦点 > 焦点状态** 已开启。\n\n若要针对特定焦点模式触发：\n\n上方选择 **特定焦点**，然后在 Mac 的焦点设置中选择触发项：\n\n- 系统设置 > 焦点\n- 选择一个焦点（例如：睡眠）\n- 焦点筛选器 > 添加筛选器…\n- 选择 Shortery\n- 选择触发项\n- 完成。\n\n任意焦点的变化每 30 秒检测一次，而特定焦点则即时检测。\n\n请参阅 [FAQ](https://www.numberfive.co/faq_shortery.html#focus) 了解如何为所有自定义焦点模式设置触发器。";
"ShortcutFocusModeUnAuthorized" = "Shortery 无法访问焦点模式。请在 **系统设置 > 安全性与隐私 > 焦点 > Shortery** 中启用。";
"ShortcutFocusModeSpecificParams" = "焦点模式的 **名称**（若在焦点筛选器中设置）将传递给快捷指令。";

"ShortcutScreenLockSelection" = "屏幕状态 ";
"ShortcutScreenLocked" = "锁定";
"ShortcutScreenUnlocked" = "解锁";

"ShortcutSelectedDevice" = "所选设备";
"ShortcutDeviceConnectionEvent" = "事件";
"ShortcutDevicesConnected" = "连接时";
"ShortcutDevicesDisconnected" = "断开时";
"ShortcutDevicesNoName" = "未知设备";

"ShortcutMonitorListLabel" = "显示器";
"ShortcutMonitorEvent" = "事件";
"ShortcutMonitorConnect" = "连接时";
"ShortcutMonitorDisconnect" = "断开时";

"ShortcutWiFiName" = "WiFi SSID";
"ShortcutWiFiSSIDEmpty" = "未连接任何 WiFi。";
"ShortcutWiFiSSIDHint" = "若要对任意 WiFi 触发快捷指令，请输入 * 作为 SSID。";
"ShortcutWiFiEvent" = "事件";
"ShortcutWiFiConnect" = "连接时";
"ShortcutWiFiDisconnect" = "断开时";

"ShortcutSunStateLabel" = "事件";
"ShortcutSunStateOffset" = "偏移量";
"ShortcutSunStateDate" = "触发时间";
"ShortcutSunStateSunRise" = "日出";
"ShortcutSunStateSunSet" = "日落";
"ShortcutSunStateNoLocationServices" = "Shortery 定位服务未启用，但此触发器需要定位服务。请在 **系统设置 > 安全性与隐私 > 定位服务 > Shortery** 中启用。";

"ShortcutFolderChooseButton" = "选择文件夹…";
"ShortcutFolderEmptyHint" = "请选择要监控的文件夹。";
"ShortcutFolderTriggerSizeChange" = "文件大小变化时也触发";

"ShortcutCalendarTitle" = "标题包含";
"ShortcutCalendarTitlePrompt" = "留空表示适用于日历中的所有事件";
"ShortcutCalendarUseTitle" = "将日历事件标题与事件名称一起作为快捷指令的输入，以换行符分隔。";
"ShortcutCalendarID" = "日历";
"ShortcutCalendarStartOffset" = "开始偏移量";
"ShortcutCalendarEndOffset" = "结束偏移量";
"ShortcutCalendarTriggerType" = "触发类型";
"ShortcutCalendarTriggerTypeBoth" = "日历事件开始与结束";
"ShortcutCalendarTriggerTypeStart" = "日历事件开始";
"ShortcutCalendarTriggerTypeEnd" = "日历事件结束";
"ShortcutCalendarUnavailable" = "请启用：隐私与安全 > 日历 > Shortery";
"ShortcutCalendarNextTimers" = "下一个事件";

"ShortcutCameraSelection" = "相机";
"ShortcutCameraAny" = "任意";
"ShortcutCameraEventLabel" = "相机切换";
"ShortcutCameraEventOn" = "开启";
"ShortcutCameraEventOff" = "关闭";
"ShortcutCameraAuthHint" = "Shortery 无法访问你的相机。请在 **系统设置 > 安全性与隐私 > 相机 > Shortery** 中启用。";

"ShortcutAudioEventLabel" = "音频";
"ShortcutAudioMinTime" = "最短播放时长";
"ShortcutAudioMinTimeHint" = "为避免 macOS 系统声音、快速播放/暂停等动作触发，请指定音频播放的最短时长（秒）。";
"ShortcutAudioPlayingStart" = "开始播放";
"ShortcutAudioPlayingEnd" = "停止播放";
"ShortcutAudioRecordingStart" = "开始录音";
"ShortcutAudioRecordingEnd" = "停止录音";
"ShortcutAudioAuthHint" = "Shortery 无法访问你的麦克风。请在 **系统设置 > 安全性与隐私 > 麦克风 > Shortery** 中启用。";

"ShortcutLanSelection" = "局域网状态";
"ShortcutLanConnected" = "连接";
"ShortcutLanDisconnected" = "断开";

// Purchases

"ShorteryHasProPurchaseLabel" = "感谢您的购买。所有 ![](ProIcon) 功能均解锁。";
"ShorteryHasNothingPurchasedLabel" = "您正在使用免费版。立即解锁 ![](ProIcon) 功能。\n\n购买过？[恢复购买](/restore_purchase).";
"ShorteryPurchaseProButton" = "购买 ![](ProIcon)，每年 %@";
"ShorteryPurchaseProTrialButton" = "试用 ![](ProIcon) 7 天，之后每年 %@";
"ShorteryPurchasedProButton" = "![](ProIcon) 版本解锁";

"ShorteryProHintMessage" = "需要 Shortery Pro";
"ShorteryProHintInfo" = "要激活此触发器，需要 Shortery Pro。您可以直接在触发器表单中购买，购买后即可使用所有专业触发器。";
"ShorteryProHintOk" = "关闭";
"ShorteryProductErrorLabel" = "无法加载 PRO 产品。请从 App Store 重新安装 Shortery.";
"ShorteryProductErrorButton" = "PRO 购买错误";

